### interface

public 정적 메서드와 public 추상 메서드를 가질 수 있다. 

자바가 public static final, public abstract 구문을 자동으로 붙여주지만 명시하는 것이 더 좋다.

### this 키워드

객체가 자기 자신을 지칭할 때 쓰는 키워드

- 지역 변수와 속성(객체 변수, 정적 변수)의 이름이 같은 경우 지역 변수가 우선한다.
- 객체 변수와 이름이 같은 지역 변수가 있는 경우 객체 변수를 사용하려면 this를 접두사로 사용한다.
- 정적 변수와 이름이 같은 지역 변수가 있는 경우 정적 변수를 사용하려면 클래스명을 접두사로 사용한다.

### super 키워드

자바는 단일 상속만을 지원한다. super는 바로 위 상위 클래스의 인스턴스를 지칭한다.

super.super는 불가능

---

# 객체 지향 설계 5원칙 (SOLID)

- SRP(Single Responsibility Principle) : 단일 책임 원칙
- OCP(Open Closed Principle) : 개방 폐쇄 원칙
- LSP(Liskov Substitution Principle) : 리스코프 치환 원칙
- ISP(Interface Segregation Principle) : 인터페이스 분리 원칙
- DIP(Dependency Inversion Principle) : 의존 역전 원칙

### 목표 : 응집도는 높이고 결합도는 낮추라

- 응집도 : 하나의 모듈 내부에 존재하는 구성 요소들의 기능적 관련성. 응집도가 높은 모듈은 하나의 책임에 집중하고 독립성이 높아져 재사용이나 기능의 수정, 유지보수가 용이하다.
- 결합도 : 모듈(클래스)간의 상호 의존 정도. 결합도가 낮으면 모듈 간의 상호 의존성이 줄어들어 객체의 재사용이나 수정, 유지보수가 용이하다.

### SRP - 단일 책임 원칙

“어떤 클래스를 변경해야 하는 이유는 오직 하나 뿐이어야 한다”

클래스를 역할과 책임에 따라 분리. 각각 하나의 역할과 책임만 갖도록.

- 객체 지향 4대 특성 중 추상화와 관련

### OCP - 개방 폐쐐 원칙

“소프트웨어 엔티티는 확장에 대해서는 열려 있어야 하지만 변경에 대해서는 닫혀 있어야 한다”

=자신의 확장에는 열려 있고, 주변의 변화에 대해서는 닫혀 있어야 한다.

ex) JDBC, MyBatis 인터페이스를 활용한 데이터베이스 프로그래밍, 스프링 프레임워크

### LSP - 리스코프 치환 법칙

“서브 타입은 언제나 자신의 기반 타입으로 교체할 수 있어야 한다”

- 하위 클래스는 상위 클래스의 한 종류다
- 구현 클래스는 인터페이스(AutoCloseable, Appendable, Cloneable, Runnable) 할 수 있어야 한다

### ISP - 인터페이스 분할 원칙

“클라이언트는 자신이 사용하지 않는 메서드에 의존 관계를 맺으면 안된다”

단일 책임 원칙 대신 적용 가능. 상위 클래스에서 메서드를 구현한 후 인터페이스에서 필요한 최소한의 메서드만을 상속한다.

보통 단일 책임의 원칙이 더 좋은 해결책이다.

### DDP - 의존 역전 원칙

“고차원 모듈은 저차원 모듈에 의존하면 안된다. 이 두 모듈 모두 다른 추상화된 것에 의존해야 한다.”

“추상적인 것은 구체적인 것에 의존하면 안 된다. 구체적인 것이 추상화된 것에 의존해야 한다.”

“자주 변경되는 클래스에 의존하지 마라.”

자신보다 변하기 쉬운 것에 의존하지 않는다.